详情结果/原始结果/redis_runA.txt
[WARN]  Running against a source checkout. In order to get our runtime dependencies we'll have to invoke Maven. Depending on the state of your system, this may take ~30-45 seconds
[DEBUG]  Running 'mvn -pl com.yahoo.ycsb:redis-binding -am package -DskipTests dependency:build-classpath -DincludeScope=compile -Dmdep.outputFilterFile=true'
java -cp /home/YCSB/redis/conf:/home/YCSB/redis/target/redis-binding-0.15.0.jar:/home/YCSB/core/target/core-0.15.0.jar:/root/.m2/repository/org/apache/htrace/htrace-core4/4.1.0-incubating/htrace-core4-4.1.0-incubating.jar:/root/.m2/repository/org/hdrhistogram/HdrHistogram/2.1.4/HdrHistogram-2.1.4.jar:/root/.m2/repository/org/codehaus/jackson/jackson-mapper-asl/1.9.4/jackson-mapper-asl-1.9.4.jar:/root/.m2/repository/redis/clients/jedis/2.9.0/jedis-2.9.0.jar:/root/.m2/repository/org/apache/commons/commons-pool2/2.4.2/commons-pool2-2.4.2.jar:/root/.m2/repository/org/codehaus/jackson/jackson-core-asl/1.9.4/jackson-core-asl-1.9.4.jar com.yahoo.ycsb.Client -db com.yahoo.ycsb.db.RedisClient -s -P workloads/workloada -p redis.host=192.168.4.134 -p redis.port=6379 -p redis.password=moonlight -threads 100 -t
Command line: -db com.yahoo.ycsb.db.RedisClient -s -P workloads/workloada -p redis.host=192.168.4.134 -p redis.port=6379 -p redis.password=moonlight -threads 100 -t
YCSB Client 0.15.0

Loading workload...
Starting test.
2018-12-28 15:56:52:681 0 sec: 0 operations; est completion in 0 second 
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
[...]
2018-12-28 15:57:02:641 10 sec: 132974 operations; 13297.4 current ops/sec; est completion in 12 minutes [READ: Count=66904, Max=233727, Min=647, Avg=7466.98, 90=9359, 99=16687, 99.9=30351, 99.99=223487] [UPDATE: Count=66090, Max=233727, Min=727, Avg=7462.63, 90=9351, 99=16719, 99.9=30511, 99.99=223743] 
2018-12-28 15:57:12:641 20 sec: 271089 operations; 13811.5 current ops/sec; est completion in 11 minutes [READ: Count=68991, Max=24351, Min=4596, Avg=7243.53, 90=8687, 99=12143, 99.9=18479, 99.99=22911] [UPDATE: Count=69133, Max=24447, Min=4580, Avg=7231.31, 90=8695, 99=12183, 99.9=18399, 99.99=23039] 
2018-12-28 15:57:22:641 30 sec: 398394 operations; 12730.5 current ops/sec; est completion in 12 minutes [READ: Count=63730, Max=17215, Min=4078, Avg=7860.3, 90=9311, 99=11423, 99.9=13631, 99.99=15639] [UPDATE: Count=63565, Max=17375, Min=4164, Avg=7845.89, 90=9295, 99=11463, 99.9=13759, 99.99=16103] 
2018-12-28 15:57:32:641 40 sec: 513567 operations; 11517.3 current ops/sec; est completion in 12 minutes [READ: Count=57381, Max=22815, Min=4824, Avg=8687.86, 90=11023, 99=13991, 99.9=17151, 99.99=19071] [UPDATE: Count=57782, Max=19231, Min=5004, Avg=8670.5, 90=11015, 99=14063, 99.9=17087, 99.99=19007] 
2018-12-28 15:57:42:641 50 sec: 634621 operations; 12105.4 current ops/sec; est completion in 12 minutes [READ: Count=60684, Max=18959, Min=4952, Avg=8270.03, 90=10527, 99=13559, 99.9=15447, 99.99=17327] [UPDATE: Count=60364, Max=18959, Min=4940, Avg=8252.46, 90=10479, 99=13479, 99.9=15495, 99.99=18431] 
2018-12-28 15:57:52:641 60 sec: 746688 operations; 11206.7 current ops/sec; est completion in 12 minutes [READ: Count=56385, Max=64223, Min=1180, Avg=8936.28, 90=11415, 99=16735, 99.9=38399, 99.99=42943] [UPDATE: Count=55702, Max=64095, Min=935, Avg=8906.08, 90=11399, 99=16815, 99.9=39935, 99.99=47263] 
2018-12-28 15:58:02:643 70 sec: 833493 operations; 8680.5 current ops/sec; est completion in 12 minutes [READ: Count=43441, Max=39583, Min=5920, Avg=11524.53, 90=16111, 99=22175, 99.9=30719, 99.99=34911] [UPDATE: Count=43345, Max=39775, Min=5892, Avg=11515.3, 90=16119, 99=22351, 99.9=30655, 99.99=34463] 
2018-12-28 15:58:12:641 80 sec: 929698 operations; 9620.5 current ops/sec; est completion in 13 minutes [READ: Count=47755, Max=26367, Min=5172, Avg=10413.34, 90=13223, 99=17135, 99.9=22431, 99.99=25311] [UPDATE: Count=48449, Max=26383, Min=5112, Avg=10366.58, 90=13183, 99=17183, 99.9=22527, 99.99=24687] 
2018-12-28 15:58:22:641 90 sec: 1019054 operations; 8935.6 current ops/sec; est completion in 13 minutes [READ: Count=44582, Max=34847, Min=5528, Avg=11194.87, 90=13839, 99=20095, 99.9=32431, 99.99=34175] [UPDATE: Count=44788, Max=34847, Min=5484, Avg=11182.61, 90=13783, 99=19967, 99.9=32431, 99.99=33887] 
2018-12-28 15:58:32:641 100 sec: 1103742 operations; 8468.8 current ops/sec; est completion in 13 minutes [READ: Count=42243, Max=56223, Min=5840, Avg=11819.97, 90=15183, 99=21679, 99.9=47423, 99.99=47967] [UPDATE: Count=42428, Max=56223, Min=5852, Avg=11785.37, 90=15111, 99=21391, 99.9=39583, 99.99=47935] 
2018-12-28 15:58:42:641 110 sec: 1219201 operations; 11545.9 current ops/sec; est completion in 13 minutes [READ: Count=57590, Max=263423, Min=4596, Avg=8631.54, 90=11351, 99=32863, 99.9=191615, 99.99=257919] [UPDATE: Count=57898, Max=263167, Min=4608, Avg=8697.81, 90=11351, 99=38495, 99.9=192127, 99.99=257919] 
2018-12-28 15:58:52:641 120 sec: 1350376 operations; 13117.5 current ops/sec; est completion in 12 minutes [READ: Count=65605, Max=171135, Min=2932, Avg=7628.86, 90=7831, 99=47327, 99.9=127679, 99.99=136319] [UPDATE: Count=65541, Max=170751, Min=2840, Avg=7596.42, 90=7779, 99=47423, 99.9=127743, 99.99=133247] 
2018-12-28 15:59:02:641 130 sec: 1494862 operations; 14448.6 current ops/sec; est completion in 12 minutes [READ: Count=72351, Max=125759, Min=4660, Avg=6931.57, 90=7571, 99=26623, 99.9=104575, 99.99=107519] [UPDATE: Count=72145, Max=125823, Min=4484, Avg=6917.3, 90=7539, 99=26607, 99.9=104127, 99.99=107583] 
2018-12-28 15:59:12:641 140 sec: 1635485 operations; 14062.3 current ops/sec; est completion in 11 minutes [READ: Count=70442, Max=36703, Min=2444, Avg=7125.96, 90=9031, 99=16719, 99.9=29071, 99.99=34143] [UPDATE: Count=70187, Max=35967, Min=2582, Avg=7097.99, 90=9015, 99=16463, 99.9=28207, 99.99=34527] 
2018-12-28 15:59:22:641 150 sec: 1749175 operations; 11369 current ops/sec; est completion in 11 minutes [READ: Count=57046, Max=33439, Min=5084, Avg=8806.78, 90=10215, 99=16063, 99.9=28783, 99.99=31167] [UPDATE: Count=56645, Max=33343, Min=5028, Avg=8782.96, 90=10215, 99=16159, 99.9=28287, 99.99=30671] 
2018-12-28 15:59:32:641 160 sec: 1865421 operations; 11624.6 current ops/sec; est completion in 11 minutes [READ: Count=58150, Max=34367, Min=4820, Avg=8603.72, 90=10327, 99=15095, 99.9=26735, 99.99=33503] [UPDATE: Count=58084, Max=34143, Min=4756, Avg=8594.96, 90=10327, 99=15047, 99.9=27823, 99.99=33951] 
2018-12-28 15:59:42:641 170 sec: 1996394 operations; 13097.3 current ops/sec; est completion in 11 minutes [READ: Count=65843, Max=34111, Min=2902, Avg=7643.62, 90=9215, 99=15015, 99.9=31455, 99.99=33119] [UPDATE: Count=65131, Max=34079, Min=2684, Avg=7627.69, 90=9247, 99=14879, 99.9=30159, 99.99=33023] 
2018-12-28 15:59:52:641 180 sec: 2143830 operations; 14743.6 current ops/sec; est completion in 11 minutes [READ: Count=73534, Max=33311, Min=5008, Avg=6783.03, 90=7923, 99=12375, 99.9=28719, 99.99=31775] [UPDATE: Count=73906, Max=33311, Min=4844, Avg=6777.92, 90=7919, 99=12287, 99.9=28943, 99.99=31663] 
2018-12-28 16:00:02:641 190 sec: 2296069 operations; 15223.9 current ops/sec; est completion in 10 minutes [READ: Count=76270, Max=22895, Min=3372, Avg=6575.12, 90=7879, 99=11935, 99.9=18575, 99.99=22175] [UPDATE: Count=75971, Max=22879, Min=3824, Avg=6558.73, 90=7863, 99=11927, 99.9=18767, 99.99=22127] 
2018-12-28 16:00:12:641 200 sec: 2443789 operations; 14772 current ops/sec; est completion in 10 minutes [READ: Count=73704, Max=26623, Min=1980, Avg=6781.86, 90=8131, 99=12119, 99.9=19887, 99.99=24479] [UPDATE: Count=74016, Max=24895, Min=1948, Avg=6756.06, 90=8103, 99=11871, 99.9=19327, 99.99=23487] 
2018-12-28 16:00:22:641 210 sec: 2583442 operations; 13965.3 current ops/sec; est completion in 10 minutes [READ: Count=70312, Max=24447, Min=4608, Avg=7162.2, 90=9175, 99=12647, 99.9=16399, 99.99=17599] [UPDATE: Count=69345, Max=24383, Min=4688, Avg=7154.41, 90=9199, 99=12743, 99.9=16079, 99.99=17439] 
2018-12-28 16:00:32:641 220 sec: 2699758 operations; 11631.6 current ops/sec; est completion in 9 minutes [READ: Count=58145, Max=22447, Min=4760, Avg=8605.44, 90=11031, 99=14807, 99.9=19231, 99.99=20751] [UPDATE: Count=58163, Max=21903, Min=5044, Avg=8587.26, 90=10975, 99=14743, 99.9=19279, 99.99=20623] 
2018-12-28 16:00:42:641 230 sec: 2830421 operations; 13066.3 current ops/sec; est completion in 9 minutes [READ: Count=65404, Max=24239, Min=4568, Avg=7659.32, 90=9663, 99=12039, 99.9=15775, 99.99=23071] [UPDATE: Count=65254, Max=24159, Min=4672, Avg=7644.66, 90=9655, 99=11951, 99.9=15567, 99.99=23023] 
2018-12-28 16:00:52:641 240 sec: 2962150 operations; 13172.9 current ops/sec; est completion in 9 minutes [READ: Count=65738, Max=18543, Min=2238, Avg=7600.48, 90=9375, 99=11655, 99.9=14759, 99.99=16255] [UPDATE: Count=65990, Max=18543, Min=2308, Avg=7578.64, 90=9335, 99=11631, 99.9=14735, 99.99=16767] 
2018-12-28 16:01:02:641 250 sec: 3096915 operations; 13476.5 current ops/sec; est completion in 9 minutes [READ: Count=67223, Max=20735, Min=4820, Avg=7428.07, 90=8759, 99=12383, 99.9=15567, 99.99=17903] [UPDATE: Count=67550, Max=20735, Min=4796, Avg=7409.52, 90=8767, 99=12439, 99.9=15567, 99.99=19647] 
2018-12-28 16:01:12:641 260 sec: 3219647 operations; 12273.2 current ops/sec; est completion in 9 minutes [READ: Count=61192, Max=26847, Min=5088, Avg=8156.63, 90=9719, 99=14559, 99.9=22975, 99.99=24063] [UPDATE: Count=61545, Max=34655, Min=5084, Avg=8134.29, 90=9663, 99=14463, 99.9=23327, 99.99=26671] 
2018-12-28 16:01:22:641 270 sec: 3333012 operations; 11336.5 current ops/sec; est completion in 9 minutes [READ: Count=56957, Max=103807, Min=5140, Avg=8828.85, 90=10951, 99=18847, 99.9=37567, 99.99=85951] [UPDATE: Count=56410, Max=103615, Min=5160, Avg=8808.72, 90=10943, 99=18751, 99.9=36447, 99.99=85759] 
2018-12-28 16:01:32:641 280 sec: 3448911 operations; 11589.9 current ops/sec; est completion in 8 minutes [READ: Count=57917, Max=121471, Min=4796, Avg=8646.58, 90=10919, 99=16199, 99.9=52031, 99.99=78591] [UPDATE: Count=57980, Max=121471, Min=4572, Avg=8609.86, 90=10895, 99=16359, 99.9=51231, 99.99=78655] 
2018-12-28 16:01:42:641 290 sec: 3560405 operations; 11149.4 current ops/sec; est completion in 8 minutes [READ: Count=55610, Max=71871, Min=5280, Avg=8985.24, 90=11159, 99=15151, 99.9=23391, 99.99=68415] [UPDATE: Count=55869, Max=71935, Min=5276, Avg=8946.41, 90=11103, 99=15063, 99.9=19871, 99.99=63519] 
2018-12-28 16:01:52:641 300 sec: 3655320 operations; 9491.5 current ops/sec; est completion in 8 minutes [READ: Count=47891, Max=83967, Min=5784, Avg=10538.99, 90=13415, 99=22351, 99.9=39455, 99.99=76543] [UPDATE: Count=47037, Max=79039, Min=5912, Avg=10529.08, 90=13463, 99=22191, 99.9=75839, 99.99=76543] 
2018-12-28 16:02:02:641 310 sec: 3760803 operations; 10548.3 current ops/sec; est completion in 8 minutes [READ: Count=52873, Max=823295, Min=4976, Avg=9466.69, 90=9719, 99=22255, 99.9=403711, 99.99=494079] [UPDATE: Count=52605, Max=823295, Min=4912, Avg=9493.46, 90=9695, 99=22687, 99.9=404479, 99.99=493823] 
2018-12-28 16:02:12:641 320 sec: 3887819 operations; 12701.6 current ops/sec; est completion in 8 minutes [READ: Count=63601, Max=99391, Min=4976, Avg=7879.29, 90=8815, 99=20431, 99.9=64191, 99.99=91711] [UPDATE: Count=63421, Max=99135, Min=4988, Avg=7862.79, 90=8799, 99=20463, 99.9=62623, 99.99=87231] 
2018-12-28 16:02:22:641 330 sec: 4039394 operations; 15157.5 current ops/sec; est completion in 8 minutes [READ: Count=75824, Max=40735, Min=4500, Avg=6607.85, 90=7587, 99=15463, 99.9=32239, 99.99=36511] [UPDATE: Count=75749, Max=40767, Min=4384, Avg=6584.04, 90=7567, 99=15383, 99.9=32159, 99.99=35903] 
2018-12-28 16:02:32:641 340 sec: 4183494 operations; 14410 current ops/sec; est completion in 7 minutes [READ: Count=72407, Max=38079, Min=1695, Avg=6952.26, 90=8099, 99=15911, 99.9=33023, 99.99=37535] [UPDATE: Count=71689, Max=37951, Min=1983, Avg=6925.3, 90=8063, 99=16015, 99.9=33951, 99.99=37503] 
2018-12-28 16:02:42:641 350 sec: 4343405 operations; 15991.1 current ops/sec; est completion in 7 minutes [READ: Count=79860, Max=37503, Min=3584, Avg=6260.57, 90=7299, 99=15015, 99.9=27471, 99.99=35391] [UPDATE: Count=80065, Max=37503, Min=3306, Avg=6242.57, 90=7291, 99=14999, 99.9=27711, 99.99=35807] 
2018-12-28 16:02:52:641 360 sec: 4483278 operations; 13987.3 current ops/sec; est completion in 7 minutes [READ: Count=70036, Max=33631, Min=2478, Avg=7156.38, 90=8807, 99=17615, 99.9=29455, 99.99=33215] [UPDATE: Count=69827, Max=34111, Min=2118, Avg=7139.55, 90=8791, 99=18047, 99.9=30287, 99.99=33503] 
2018-12-28 16:03:02:641 370 sec: 4618407 operations; 13512.9 current ops/sec; est completion in 7 minutes [READ: Count=67726, Max=118463, Min=4512, Avg=7406.22, 90=8631, 99=44767, 99.9=82303, 99.99=95679] [UPDATE: Count=67408, Max=118207, Min=4532, Avg=7390.61, 90=8607, 99=44767, 99.9=82367, 99.99=90175] 
2018-12-28 16:03:12:641 380 sec: 4750608 operations; 13220.1 current ops/sec; est completion in 7 minutes [READ: Count=65819, Max=116799, Min=4588, Avg=7576.96, 90=9359, 99=37599, 99.9=90623, 99.99=110847] [UPDATE: Count=66375, Max=117183, Min=4652, Avg=7549.02, 90=9319, 99=37503, 99.9=90623, 99.99=113343] 
2018-12-28 16:03:22:641 390 sec: 4890509 operations; 13990.1 current ops/sec; est completion in 6 minutes [READ: Count=69785, Max=29407, Min=4572, Avg=7150.28, 90=8975, 99=13983, 99.9=24255, 99.99=28991] [UPDATE: Count=70126, Max=29375, Min=4692, Avg=7142.16, 90=8967, 99=14279, 99.9=24927, 99.99=28575] 
2018-12-28 16:03:32:641 400 sec: 5018850 operations; 12834.1 current ops/sec; est completion in 6 minutes [READ: Count=64101, Max=113471, Min=2350, Avg=7817.89, 90=9399, 99=44991, 99.9=84415, 99.99=97023] [UPDATE: Count=64224, Max=113535, Min=2204, Avg=7763.69, 90=9271, 99=44927, 99.9=84287, 99.99=108671] 
2018-12-28 16:03:42:641 410 sec: 5144300 operations; 12545 current ops/sec; est completion in 6 minutes [READ: Count=62707, Max=104511, Min=2970, Avg=7976.41, 90=10247, 99=21743, 99.9=91583, 99.99=95871] [UPDATE: Count=62760, Max=97343, Min=2914, Avg=7962.8, 90=10191, 99=23183, 99.9=94719, 99.99=95871] 
2018-12-28 16:03:52:641 420 sec: 5276412 operations; 13211.2 current ops/sec; est completion in 6 minutes [READ: Count=66096, Max=28671, Min=4420, Avg=7587.09, 90=9887, 99=13143, 99.9=17791, 99.99=24223] [UPDATE: Count=65995, Max=28559, Min=4412, Avg=7548.8, 90=9799, 99=13071, 99.9=18671, 99.99=23119] 
2018-12-28 16:04:02:641 430 sec: 5392389 operations; 11597.7 current ops/sec; est completion in 6 minutes [READ: Count=58079, Max=80895, Min=5368, Avg=8620.43, 90=10535, 99=14687, 99.9=23919, 99.99=73215] [UPDATE: Count=57909, Max=80959, Min=5328, Avg=8618.84, 90=10551, 99=14607, 99.9=24015, 99.99=73151] 
2018-12-28 16:04:12:641 440 sec: 5529428 operations; 13703.9 current ops/sec; est completion in 5 minutes [READ: Count=68492, Max=29519, Min=4952, Avg=7301.09, 90=8855, 99=12431, 99.9=15663, 99.99=24159] [UPDATE: Count=68536, Max=29487, Min=4964, Avg=7289.73, 90=8847, 99=12311, 99.9=15671, 99.99=22655] 
2018-12-28 16:04:22:641 450 sec: 5641783 operations; 11235.5 current ops/sec; est completion in 5 minutes [READ: Count=56425, Max=22943, Min=4956, Avg=8904.2, 90=11159, 99=14151, 99.9=19583, 99.99=21647] [UPDATE: Count=55940, Max=21999, Min=4960, Avg=8891.4, 90=11119, 99=14199, 99.9=19071, 99.99=21215] 
2018-12-28 16:04:32:641 460 sec: 5736355 operations; 9457.2 current ops/sec; est completion in 5 minutes [READ: Count=47267, Max=200575, Min=6028, Avg=10576.64, 90=13079, 99=26383, 99.9=189055, 99.99=192383] [UPDATE: Count=47311, Max=200063, Min=5996, Avg=10568.64, 90=13095, 99=26943, 99.9=188287, 99.99=192383] 
2018-12-28 16:04:42:641 470 sec: 5836497 operations; 10014.2 current ops/sec; est completion in 5 minutes [READ: Count=50273, Max=60159, Min=4816, Avg=9996.58, 90=12991, 99=23231, 99.9=50175, 99.99=54335] [UPDATE: Count=49859, Max=60447, Min=4784, Avg=9969.04, 90=12999, 99=23231, 99.9=52767, 99.99=57375] 
2018-12-28 16:04:52:641 480 sec: 5926648 operations; 9015.1 current ops/sec; est completion in 5 minutes [READ: Count=45342, Max=573439, Min=5600, Avg=11115.28, 90=13175, 99=23679, 99.9=565759, 99.99=572927] [UPDATE: Count=44819, Max=575487, Min=5600, Avg=11069.25, 90=13135, 99=23711, 99.9=564223, 99.99=572927] 
2018-12-28 16:05:02:641 490 sec: 6066635 operations; 13998.7 current ops/sec; est completion in 5 minutes [READ: Count=70204, Max=38143, Min=5024, Avg=7155.12, 90=8343, 99=12343, 99.9=33279, 99.99=36767] [UPDATE: Count=69772, Max=38559, Min=4988, Avg=7131.5, 90=8335, 99=11967, 99.9=32655, 99.99=37759] 
2018-12-28 16:05:12:641 500 sec: 6227030 operations; 16039.5 current ops/sec; est completion in 5 minutes [READ: Count=79865, Max=34943, Min=2216, Avg=6234.16, 90=7059, 99=14351, 99.9=27215, 99.99=34015] [UPDATE: Count=80528, Max=35391, Min=2104, Avg=6222.5, 90=7043, 99=14607, 99.9=28623, 99.99=34367] 
2018-12-28 16:05:22:641 510 sec: 6374582 operations; 14755.2 current ops/sec; est completion in 4 minutes [READ: Count=73646, Max=86975, Min=1781, Avg=6737.32, 90=6963, 99=44639, 99.9=55391, 99.99=59615] [UPDATE: Count=73903, Max=86911, Min=1979, Avg=6767.33, 90=6947, 99=45119, 99.9=58015, 99.99=65375] 
2018-12-28 16:05:32:641 520 sec: 6502977 operations; 12839.5 current ops/sec; est completion in 4 minutes [READ: Count=64089, Max=129279, Min=1179, Avg=7833.11, 90=9055, 99=27295, 99.9=116927, 99.99=128319] [UPDATE: Count=64318, Max=129535, Min=1068, Avg=7791.83, 90=9127, 99=26911, 99.9=112703, 99.99=128191] 
2018-12-28 16:05:42:641 530 sec: 6640166 operations; 13718.9 current ops/sec; est completion in 4 minutes [READ: Count=68363, Max=46975, Min=4680, Avg=7304.6, 90=8895, 99=22447, 99.9=32639, 99.99=39743] [UPDATE: Count=68818, Max=47167, Min=4456, Avg=7282.77, 90=8855, 99=22607, 99.9=32687, 99.99=39807] 
2018-12-28 16:05:52:641 540 sec: 6795530 operations; 15536.4 current ops/sec; est completion in 4 minutes [READ: Count=77546, Max=26191, Min=1723, Avg=6436.3, 90=7863, 99=16007, 99.9=24271, 99.99=25583] [UPDATE: Count=77830, Max=26095, Min=1519, Avg=6435.28, 90=7863, 99=16375, 99.9=24239, 99.99=25487] 
2018-12-28 16:06:02:641 550 sec: 6942609 operations; 14707.9 current ops/sec; est completion in 4 minutes [READ: Count=73406, Max=33759, Min=4500, Avg=6801.95, 90=8287, 99=18591, 99.9=26831, 99.99=31007] [UPDATE: Count=73670, Max=34143, Min=4492, Avg=6791.95, 90=8271, 99=18639, 99.9=26895, 99.99=33023] 
2018-12-28 16:06:12:641 560 sec: 7060015 operations; 11740.6 current ops/sec; est completion in 3 minutes [READ: Count=58864, Max=223103, Min=2588, Avg=8494.89, 90=8903, 99=50271, 99.9=138623, 99.99=180479] [UPDATE: Count=58550, Max=222975, Min=2456, Avg=8529.26, 90=8871, 99=50527, 99.9=139007, 99.99=180735] 
2018-12-28 16:06:22:641 570 sec: 7204605 operations; 14459 current ops/sec; est completion in 3 minutes [READ: Count=72543, Max=95679, Min=4252, Avg=6899.08, 90=7951, 99=26879, 99.9=51263, 99.99=90879] [UPDATE: Count=72031, Max=122175, Min=4016, Avg=6890.05, 90=7923, 99=26751, 99.9=52063, 99.99=93951] 
2018-12-28 16:06:32:641 580 sec: 7309080 operations; 10447.5 current ops/sec; est completion in 3 minutes [READ: Count=52421, Max=570367, Min=973, Avg=9457.5, 90=9615, 99=78847, 99.9=178303, 99.99=566271] [UPDATE: Count=52049, Max=567295, Min=952, Avg=9413.97, 90=9495, 99=81727, 99.9=177919, 99.99=565247] 
2018-12-28 16:06:42:641 590 sec: 7357832 operations; 4875.2 current ops/sec; est completion in 3 minutes [READ: Count=24474, Max=1601535, Min=4696, Avg=20825, 90=17583, 99=326399, 99.9=1595391, 99.99=1600511] [UPDATE: Count=24295, Max=1601535, Min=4756, Avg=20896.41, 90=18479, 99=327935, 99.9=1595391, 99.99=1599487] 
2018-12-28 16:06:52:641 600 sec: 7477256 operations; 11942.4 current ops/sec; est completion in 3 minutes [READ: Count=59702, Max=534015, Min=4420, Avg=8470.26, 90=9335, 99=17615, 99.9=285183, 99.99=366591] [UPDATE: Count=59712, Max=534015, Min=4360, Avg=8273.77, 90=9311, 99=16927, 99.9=284671, 99.99=366591] 
2018-12-28 16:07:02:641 610 sec: 7605657 operations; 12840.1 current ops/sec; est completion in 3 minutes [READ: Count=63947, Max=16927, Min=5056, Avg=7794.73, 90=9959, 99=12359, 99.9=14167, 99.99=15151] [UPDATE: Count=64463, Max=16911, Min=5076, Avg=7777.49, 90=9959, 99=12359, 99.9=14127, 99.99=15431] 
2018-12-28 16:07:12:641 620 sec: 7744439 operations; 13878.2 current ops/sec; est completion in 3 minutes [READ: Count=69344, Max=14183, Min=4484, Avg=7211.6, 90=8943, 99=10727, 99.9=12295, 99.99=13215] [UPDATE: Count=69439, Max=14183, Min=4428, Avg=7198.24, 90=8943, 99=10743, 99.9=12447, 99.99=13367] 
2018-12-28 16:07:22:641 630 sec: 7873940 operations; 12950.1 current ops/sec; est completion in 2 minutes [READ: Count=64678, Max=55583, Min=4756, Avg=7732.55, 90=9519, 99=11975, 99.9=15607, 99.99=50783] [UPDATE: Count=64818, Max=55519, Min=4440, Avg=7707.52, 90=9463, 99=11967, 99.9=16895, 99.99=50719] 
2018-12-28 16:07:32:641 640 sec: 8000570 operations; 12663 current ops/sec; est completion in 2 minutes [READ: Count=63289, Max=23839, Min=3478, Avg=7910.31, 90=9703, 99=11983, 99.9=17647, 99.99=22751] [UPDATE: Count=63341, Max=23791, Min=3116, Avg=7879.99, 90=9679, 99=12015, 99.9=17631, 99.99=22767] 
2018-12-28 16:07:42:641 650 sec: 8130139 operations; 12956.9 current ops/sec; est completion in 2 minutes [READ: Count=64719, Max=18799, Min=4752, Avg=7727.7, 90=9591, 99=11815, 99.9=14263, 99.99=17631] [UPDATE: Count=64847, Max=18527, Min=4808, Avg=7706, 90=9575, 99=11799, 99.9=14087, 99.99=17567] 
2018-12-28 16:07:52:641 660 sec: 8261432 operations; 13129.3 current ops/sec; est completion in 2 minutes [READ: Count=65608, Max=18607, Min=2172, Avg=7625.71, 90=9583, 99=12991, 99.9=15407, 99.99=17679] [UPDATE: Count=65687, Max=18607, Min=2454, Avg=7603.84, 90=9543, 99=13095, 99.9=16431, 99.99=18063] 
2018-12-28 16:08:02:641 670 sec: 8379266 operations; 11783.4 current ops/sec; est completion in 2 minutes [READ: Count=58863, Max=79039, Min=4984, Avg=8492.95, 90=10327, 99=14295, 99.9=29759, 99.99=76287] [UPDATE: Count=58970, Max=81023, Min=5044, Avg=8475.56, 90=10319, 99=14319, 99.9=29823, 99.99=76351] 
2018-12-28 16:08:12:641 680 sec: 8489085 operations; 10981.9 current ops/sec; est completion in 2 minutes [READ: Count=54785, Max=21887, Min=5416, Avg=9116.9, 90=11103, 99=14767, 99.9=18911, 99.99=20351] [UPDATE: Count=55033, Max=21839, Min=5412, Avg=9090.57, 90=11079, 99=14687, 99.9=19055, 99.99=19855] 
2018-12-28 16:08:22:641 690 sec: 8594122 operations; 10503.7 current ops/sec; est completion in 1 minute [READ: Count=52719, Max=55999, Min=5436, Avg=9528.16, 90=11775, 99=16415, 99.9=24895, 99.99=49631] [UPDATE: Count=52320, Max=55999, Min=5448, Avg=9510.82, 90=11751, 99=16671, 99.9=24639, 99.99=49599] 
2018-12-28 16:08:32:641 700 sec: 8690362 operations; 9624 current ops/sec; est completion in 1 minute [READ: Count=48300, Max=51487, Min=5544, Avg=10403.94, 90=13519, 99=25471, 99.9=39007, 99.99=40959] [UPDATE: Count=47937, Max=51743, Min=5584, Avg=10370.87, 90=13471, 99=25439, 99.9=35327, 99.99=39263] 
2018-12-28 16:08:42:641 710 sec: 8780668 operations; 9030.6 current ops/sec; est completion in 1 minute [READ: Count=45172, Max=456703, Min=5152, Avg=11062.95, 90=13199, 99=29999, 99.9=438271, 99.99=446975] [UPDATE: Count=45131, Max=456447, Min=5120, Avg=11082.86, 90=13247, 99=30223, 99.9=438271, 99.99=447231] 
2018-12-28 16:08:52:641 720 sec: 8896693 operations; 11602.5 current ops/sec; est completion in 1 minute [READ: Count=57980, Max=129471, Min=4832, Avg=8620.17, 90=9807, 99=20223, 99.9=45439, 99.99=120319] [UPDATE: Count=58050, Max=130687, Min=4832, Avg=8615.82, 90=9775, 99=22863, 99.9=50559, 99.99=127231] 
2018-12-28 16:09:02:641 730 sec: 9028794 operations; 13210.1 current ops/sec; est completion in 1 minute [READ: Count=66161, Max=39519, Min=4904, Avg=7580.57, 90=8927, 99=15279, 99.9=30223, 99.99=33663] [UPDATE: Count=65946, Max=39519, Min=4784, Avg=7556.92, 90=8887, 99=15215, 99.9=30767, 99.99=38815] 
2018-12-28 16:09:12:641 740 sec: 9168982 operations; 14018.8 current ops/sec; est completion in 1 minute [READ: Count=70280, Max=38847, Min=1577, Avg=7139.82, 90=7995, 99=17935, 99.9=32175, 99.99=37727] [UPDATE: Count=69909, Max=38815, Min=1687, Avg=7123.37, 90=7967, 99=17983, 99.9=31951, 99.99=37023] 
2018-12-28 16:09:22:641 750 sec: 9315955 operations; 14697.3 current ops/sec; est completion in 56 seconds [READ: Count=73307, Max=34751, Min=4624, Avg=6810.36, 90=7807, 99=14263, 99.9=28271, 99.99=33279] [UPDATE: Count=73653, Max=35871, Min=4660, Avg=6794.29, 90=7771, 99=14847, 99.9=29743, 99.99=33279] 
2018-12-28 16:09:32:641 760 sec: 9458198 operations; 14224.3 current ops/sec; est completion in 44 seconds [READ: Count=71110, Max=36159, Min=4708, Avg=7039.87, 90=8167, 99=16079, 99.9=30223, 99.99=33855] [UPDATE: Count=71133, Max=35711, Min=4824, Avg=7018.06, 90=8135, 99=16023, 99.9=30591, 99.99=33919] 
2018-12-28 16:09:42:641 770 sec: 9592959 operations; 13476.1 current ops/sec; est completion in 33 seconds [READ: Count=67589, Max=93567, Min=4804, Avg=7432.84, 90=9495, 99=15871, 99.9=53695, 99.99=64383] [UPDATE: Count=67180, Max=93375, Min=4780, Avg=7404.7, 90=9455, 99=15591, 99.9=54655, 99.99=64415] 
2018-12-28 16:09:52:641 780 sec: 9730885 operations; 13792.6 current ops/sec; est completion in 22 seconds [READ: Count=68864, Max=28687, Min=4712, Avg=7268.01, 90=8983, 99=14111, 99.9=24463, 99.99=27727] [UPDATE: Count=69065, Max=28655, Min=4664, Avg=7229.22, 90=8903, 99=13695, 99.9=24735, 99.99=28319] 
2018-12-28 16:10:02:641 790 sec: 9869607 operations; 13872.2 current ops/sec; est completion in 11 seconds [READ: Count=69602, Max=25791, Min=4360, Avg=7216.41, 90=8855, 99=14119, 99.9=20719, 99.99=25551] [UPDATE: Count=69117, Max=25743, Min=4392, Avg=7198.02, 90=8847, 99=13895, 99.9=20767, 99.99=25391] 
2018-12-28 16:10:11:263 798 sec: 10000000 operations; 15123.29 current ops/sec; [READ: Count=65105, Max=20271, Min=560, Avg=6600.78, 90=8031, 99=11575, 99.9=17263, 99.99=19775] [CLEANUP: Count=100, Max=550, Min=12, Avg=21.04, 90=19, 99=51, 99.9=550, 99.99=550] [UPDATE: Count=65276, Max=20255, Min=348, Avg=6587.22, 90=8023, 99=11655, 99.9=17487, 99.99=20047] 
[OVERALL], RunTime(ms), 798622
[OVERALL], Throughput(ops/sec), 12521.568401571707
[TOTAL_GCS_PS_Scavenge], Count, 284
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 216
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.027046587747394886
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 284
[TOTAL_GC_TIME], Time(ms), 216
[TOTAL_GC_TIME_%], Time(%), 0.027046587747394886
[READ], Operations, 5002278
[READ], AverageLatency(us), 7993.830715925824
[READ], MinLatency(us), 560
[READ], MaxLatency(us), 1601535
[READ], 95thPercentileLatency(us), 11791
[READ], 99thPercentileLatency(us), 18335
[READ], Return=OK, 5002278
[CLEANUP], Operations, 100
[CLEANUP], AverageLatency(us), 21.04
[CLEANUP], MinLatency(us), 12
[CLEANUP], MaxLatency(us), 550
[CLEANUP], 95thPercentileLatency(us), 26
[CLEANUP], 99thPercentileLatency(us), 51
[UPDATE], Operations, 4997722
[UPDATE], AverageLatency(us), 7973.523407664532
[UPDATE], MinLatency(us), 348
[UPDATE], MaxLatency(us), 1601535
[UPDATE], 95thPercentileLatency(us), 11767
[UPDATE], 99thPercentileLatency(us), 18367
[UPDATE], Return=OK, 4997722